In [69]:
# import necessary libraries
import pandas as pd
import math

In [2]:
csv_data = pd.read_csv('csv_data.csv')
csv_data

   Name   Age               race
0  Tigi    24   african-american
1  Mobi    27              asian
2  Waga    32             latino

In [3]:
data = pd.read_excel('excel_data.xlsx')
data

   Students  Height Fav_color  Salary()
0    Akwasi     184     Black     70000
1  Franklin     175  Burgundy     20000
2  Nashirat     178    Purple     70000
3     Irene     188     Green     70000
4      Amma     182      Pink     70000
5    Fauzia     186    Yellow     70000

In [4]:
pro_est_df = pd.read_csv('PRODUCTION ESTIMATES.csv')
pro_est_df

,REGION,DISTRICT,YEAR,CROP,AREA (HA),YIELD (MT/HA),PRODUCTION (MT)
0,WESTERN,SHAMA AHANTA EAST,2008,MAIZE,"1,099.00",1.15,"1,263.85"
1,WESTERN,WEST AHANTA,2008,MAIZE,"1,433.00",1.19,"1,705.27"
2,WESTERN,MPORHOR WASSA EAST,2008,MAIZE,"2,034.00",1.32,"2,684.88"
3,WESTERN,WASSA WEST,2008,MAIZE,"2,204.00",1.2,"2,644.80"
4,WESTERN,EAST NZEMA,2008,MAIZE,"1,550.00",1.38,"2,139.00"
...,...,...,...,...,...,...,...
8231,NORTHERN REGION,MAMPRUGU MOAGDURI,2017,CASSAVA,900,7.95,"7,155.00"
8232,NORTHERN REGION,YENDI,2017,CASSAVA,"4,790.00",13.59,"65,096.10"
8233,NORTHERN REGION,MION,2017,CASSAVA,"3,831.00",6.96,"26,663.76"
8234,NORTHERN REGION,TATALE SANGULI,2017,CASSAVA,"5,192.00",13.85,"71,909.20"
8235,NORTHERN REGION,ZABZUGU,2017,CASSAVA,"4,612.00",13.85,"63,876.20"

In [5]:
# ascertain the column types
pro_est_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8236 entries, 0 to 8235
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   REGION           8236 non-null   object
 1   DISTRICT         8236 non-null   object
 2   YEAR             8236 non-null   int64
 3   CROP             8236 non-null   object
 4   AREA (HA)        8236 non-null   object
 5   YIELD (MT/HA)    8220 non-null   object
 6   PRODUCTION (MT)  8234 non-null   object
dtypes: int64(1), object(6)
memory usage: 450.5+ KB

In [83]:
data = pd.read_excel('excel_data.xlsx')
data

   Students  Height Fav_color  Salary()
0    Akwasi     184     Black     70000
1  Franklin     175  Burgundy     20000
2  Nashirat     178    Purple     70000
3     Irene     188     Green     70000
4      Amma     182      Pink     70000
5    Fauzia     186    Yellow     70000

In [7]:
# count null values within each column
data.isnull().sum()

Students     0
Height       0
Fav_color    0
Salary()     0
dtype: int64

In [8]:
pro_est_df.isnull().sum()

REGION              0
DISTRICT            0
YEAR                0
CROP                0
AREA (HA)           0
YIELD (MT/HA)      16
PRODUCTION (MT)     2
dtype: int64

In [9]:
pro_est_df.columns

Index(['REGION', 'DISTRICT', 'YEAR', 'CROP', 'AREA (HA)', 'YIELD (MT/HA)',
       'PRODUCTION (MT)'],
      dtype='object')

In [10]:
pro_est_df.REGION

0               WESTERN
1               WESTERN
2               WESTERN
3               WESTERN
4               WESTERN
             ...
8231    NORTHERN REGION
8232    NORTHERN REGION
8233    NORTHERN REGION
8234    NORTHERN REGION
8235    NORTHERN REGION
Name: REGION, Length: 8236, dtype: object

In [11]:
pro_est_df['REGION']

0               WESTERN
1               WESTERN
2               WESTERN
3               WESTERN
4               WESTERN
             ...
8231    NORTHERN REGION
8232    NORTHERN REGION
8233    NORTHERN REGION
8234    NORTHERN REGION
8235    NORTHERN REGION
Name: REGION, Length: 8236, dtype: object

In [12]:
pro_est_df['AREA (HA)']

0       1,099.00
1       1,433.00
2       2,034.00
3       2,204.00
4       1,550.00
          ...
8231         900
8232    4,790.00
8233    3,831.00
8234    5,192.00
8235    4,612.00
Name: AREA (HA), Length: 8236, dtype: object

In [13]:
# get rows and columns
rows_cols = pro_est_df.shape

In [14]:
type(rows_cols)

tuple

In [15]:
rows_cols[1]

7

In [16]:
# get first 5 rows
pro_est_df.head()

,REGION,DISTRICT,YEAR,CROP,AREA (HA),YIELD (MT/HA),PRODUCTION (MT)
0,WESTERN,SHAMA AHANTA EAST,2008,MAIZE,"1,099.00",1.15,"1,263.85"
1,WESTERN,WEST AHANTA,2008,MAIZE,"1,433.00",1.19,"1,705.27"
2,WESTERN,MPORHOR WASSA EAST,2008,MAIZE,"2,034.00",1.32,"2,684.88"
3,WESTERN,WASSA WEST,2008,MAIZE,"2,204.00",1.2,"2,644.80"
4,WESTERN,EAST NZEMA,2008,MAIZE,"1,550.00",1.38,"2,139.00"

In [17]:
# get last 5 rows
pro_est_df.tail()

,REGION,DISTRICT,YEAR,CROP,AREA (HA),YIELD (MT/HA),PRODUCTION (MT)
8231,NORTHERN REGION,MAMPRUGU MOAGDURI,2017,CASSAVA,900,7.95,"7,155.00"
8232,NORTHERN REGION,YENDI,2017,CASSAVA,"4,790.00",13.59,"65,096.10"
8233,NORTHERN REGION,MION,2017,CASSAVA,"3,831.00",6.96,"26,663.76"
8234,NORTHERN REGION,TATALE SANGULI,2017,CASSAVA,"5,192.00",13.85,"71,909.20"
8235,NORTHERN REGION,ZABZUGU,2017,CASSAVA,"4,612.00",13.85,"63,876.20"

In [18]:
# get first/last 13 rows
pro_est_df.tail(13)

,REGION,DISTRICT,YEAR,CROP,AREA (HA),YIELD (MT/HA),PRODUCTION (MT)
8223,NORTHERN REGION,SAWLA/TUNA/KALBA,2017,CASSAVA,"1,258.00",14.24,"17,913.92"
8224,NORTHERN REGION,TAMALE METRO,2017,CASSAVA,"1,567.32",6.96,"10,908.55"
8225,NORTHERN REGION,SAGNERIGU,2017,CASSAVA,346,6.96,"2,408.16"
8226,NORTHERN REGION,TOLON,2017,CASSAVA,"4,738.00",13.71,"64,957.98"
8227,NORTHERN REGION,KUMBUNGU,2017,CASSAVA,"1,000.00",9,"9,000.00"
8228,NORTHERN REGION,WEST GONJA,2017,CASSAVA,"14,100.00",25.6,"360,960.00"
8229,NORTHERN REGION,NORTH GONJA,2017,CASSAVA,850,13,"11,050.00"
8230,NORTHERN REGION,WEST MAMPRUSI,2017,CASSAVA,"1,100.00",5,"5,500.00"
8231,NORTHERN REGION,MAMPRUGU MOAGDURI,2017,CASSAVA,900,7.95,"7,155.00"
8232,NORTHERN REGION,YENDI,2017,CASSAVA,"4,790.00",13.59,"65,096.10"
8233,NORTHERN REGION,MION,2017,CASSAVA,"3,831.00",6.96,"26,663.76"
8234,NORTHERN REGION,TATALE SANGULI,2017,CASSAVA,"5,192.00",13.85,"71,909.20"
8235,NORTHERN REGION,ZABZUGU,2017,CASSAVA,"4,612.00",13.85,"63,876.20"

In [19]:
pro_est_df.columns

Index(['REGION', 'DISTRICT', 'YEAR', 'CROP', 'AREA (HA)', 'YIELD (MT/HA)',
       'PRODUCTION (MT)'],
      dtype='object')

In [20]:
# get fraction of all columns
pro_est_df[[ 'YEAR', 'AREA (HA)', 'YIELD (MT/HA)','PRODUCTION (MT)']]

      YEAR AREA (HA) YIELD (MT/HA) PRODUCTION (MT)
0     2008  1,099.00          1.15        1,263.85
1     2008  1,433.00          1.19        1,705.27
2     2008  2,034.00          1.32        2,684.88
3     2008  2,204.00           1.2        2,644.80
4     2008  1,550.00          1.38        2,139.00
...    ...       ...           ...             ...
8231  2017       900          7.95        7,155.00
8232  2017  4,790.00         13.59       65,096.10
8233  2017  3,831.00          6.96       26,663.76
8234  2017  5,192.00         13.85       71,909.20
8235  2017  4,612.00         13.85       63,876.20

[8236 rows x 4 columns]

In [21]:
# get descriptive statistics
pro_est_df.describe()

              YEAR
count  8236.000000
mean   2012.969888
std       2.864953
min    2008.000000
25%    2011.000000
50%    2013.000000
75%    2016.000000
max    2017.000000

In [22]:
data = pd.read_excel('excel_data.xlsx')
data

   Students  Height Fav_color  Salary()
0    Akwasi     184     Black     70000
1  Franklin     175  Burgundy     20000
2  Nashirat     178    Purple     70000
3     Irene     188     Green     70000
4      Amma     182      Pink     70000
5    Fauzia     186    Yellow     70000

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Students   6 non-null      object
 1   Height     6 non-null      int64
 2   Fav_color  6 non-null      object
 3   Salary()   6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [24]:
data.describe()

           Height      Salary()
count    6.000000      6.000000
mean   182.166667  61666.666667
std      4.915960  20412.414523
min    175.000000  20000.000000
25%    179.000000  70000.000000
50%    183.000000  70000.000000
75%    185.500000  70000.000000
max    188.000000  70000.000000

In [25]:
data.Height.mean()

182.16666666666666

In [26]:
data.Height.min()

175

In [27]:
data.Height.max()

188

In [28]:
data.Height.mean()

182.16666666666666

In [29]:
data.Height.std()

4.915960401250875

In [30]:
# get a dataframe using a condition
data[data['Height'] > data.Height.mean() ]

  Students  Height Fav_color  Salary()
0   Akwasi     184     Black     70000
3    Irene     188     Green     70000
5   Fauzia     186    Yellow     70000

In [31]:
data.Height.mean()

182.16666666666666

In [32]:
data.columns

Index(['Students', 'Height', 'Fav_color', 'Salary()'], dtype='object')

In [33]:
data[(data['Height'] < 180) | (data['Salary()'] == 30000)]

   Students  Height Fav_color  Salary()
1  Franklin     175  Burgundy     20000
2  Nashirat     178    Purple     70000

In [37]:
data.columns

Index(['Students', 'Height', 'Fav_color', 'Salary()'], dtype='object')

In [39]:
data

   Students  Height Fav_color  Salary()
0    Akwasi     184     Black     70000
1  Franklin     175  Burgundy     20000
2  Nashirat     178    Purple     70000
3     Irene     188     Green     70000
4      Amma     182      Pink     70000
5    Fauzia     186    Yellow     70000

In [38]:
# finding a wording in a column
data[data['Fav_color'].str.contains('B')]

   Students  Height Fav_color  Salary()
0    Akwasi     184     Black     70000
1  Franklin     175  Burgundy     20000

In [42]:
data[data['Fav_color'].str.contains('e')]

   Students  Height Fav_color  Salary()
2  Nashirat     178    Purple     70000
3     Irene     188     Green     70000
5    Fauzia     186    Yellow     70000

In [43]:
## add tiems to the a specific column
#general method
data['Fav_color'] = data['Fav_color'] + ' color'

In [44]:
data

   Students  Height       Fav_color  Salary()
0    Akwasi     184     Black color     70000
1  Franklin     175  Burgundy color     20000
2  Nashirat     178    Purple color     70000
3     Irene     188     Green color     70000
4      Amma     182      Pink color     70000
5    Fauzia     186    Yellow color     70000

In [48]:
data['Students'] = 'Dr. ' + data['Students']

In [51]:
data['Salary()'] = 200 + data['Salary()']

In [53]:
## add tiems to the a specific column
#general method
data['Fav_color'] = 'Â¢ '+ data['Fav_color']

In [54]:
data

       Students  Height         Fav_color  Salary()
0    Dr. Akwasi     184     Â¢ Black color     70200
1  Dr. Franklin     175  Â¢ Burgundy color     20200
2  Dr. Nashirat     178    Â¢ Purple color     70200
3     Dr. Irene     188     Â¢ Green color     70200
4      Dr. Amma     182      Â¢ Pink color     70200
5    Dr. Fauzia     186    Â¢ Yellow color     70200

In [57]:
try_data = pd.read_excel(r'C:\Users\JB479JV\OneDrive - EY\Desktop\JanBootCamp\New folder\try_data.xlsx')

In [58]:
try_data

   Students  Height Fav_color  Salary()
0    Akwasi     184     Black     70000
1  Franklin     175  Burgundy     20000
2  Nashirat     178    Purple     70000
3     Irene     188     Green     70000
4      Amma     182      Pink     70000
5    Fauzia     186    Yellow     70000

In [59]:
import os

In [65]:
os.getcwd()

'C:\\Users\\JB479JV\\OneDrive - EY\\Desktop\\JanBootCamp\\New folder'

In [66]:
os.chdir(r'C:\Users\JB479JV\OneDrive - EY\Desktop\JanBootCamp')

In [64]:
try_data = pd.read_excel('try_data.xlsx')

In [85]:
## add tiems to the a specific column
#function method
data['Salary()'] = data.apply(lambda row: math.sqrt(row['Salary()']) if row['Salary()'] > 20000 else row['Salary()'], axis = 1)

In [86]:
data

   Students  Height Fav_color      Salary()
0    Akwasi     184     Black    264.575131
1  Franklin     175  Burgundy  20000.000000
2  Nashirat     178    Purple    264.575131
3     Irene     188     Green    264.575131
4      Amma     182      Pink    264.575131
5    Fauzia     186    Yellow    264.575131

In [88]:
data['Height'].apply(lambda row: math.sqrt(row) if row > 180 else row)

0     13.564660
1    175.000000
2    178.000000
3     13.711309
4     13.490738
5     13.638182
Name: Height, dtype: float64

In [89]:
data

   Students  Height Fav_color      Salary()
0    Akwasi     184     Black    264.575131
1  Franklin     175  Burgundy  20000.000000
2  Nashirat     178    Purple    264.575131
3     Irene     188     Green    264.575131
4      Amma     182      Pink    264.575131
5    Fauzia     186    Yellow    264.575131

In [99]:
# drop a column
# data_one = data.drop('Salary()', axis = 1)
data.drop('Salary()', axis = 1, inplace = True)

#drop a row

KeyError: "['Salary()'] not found in axis"

In [98]:
data

   Students  Height Fav_color
0    Akwasi     184     Black
1  Franklin     175  Burgundy
2  Nashirat     178    Purple
3     Irene     188     Green
4      Amma     182      Pink
5    Fauzia     186    Yellow

In [95]:
data_one

   Students  Height Fav_color
0    Akwasi     184     Black
1  Franklin     175  Burgundy
2  Nashirat     178    Purple
3     Irene     188     Green
4      Amma     182      Pink
5    Fauzia     186    Yellow